Revit 2027 API
Application.NewSpaceSet Method
Creates a new instance of a space set.
Namespace: Autodesk.Revit.Creation
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public SpaceSet NewSpaceSet()
Public Function NewSpaceSet As SpaceSet
public:
SpaceSet^ NewSpaceSet()
member NewSpaceSet : unit -> SpaceSet
Return Value
SpaceSet
See Also
Reference
Application Class
Autodesk.Revit.Creation Namespace